{
  "SearchEfficiencyMessage": "This is the percentage of all search results that 1) fall within the defined search region, and 2) are not a duplication of data from any prior search.",
  "ProjectedSearchCostMessage": "This metric calculates the remaining area to be searched within the defined search region and estimates the number of additional API calls that will be needed to search this remaining area using the average unique area search by each API call made so far.  The unique area is defined as the area searched by a call to the Google API that does not overlap with any previously searched areas.  This estimation is multiplied by the API cost per call and added to the actual budget spent so far.",
  "ProjectedSavingsVsNaiveSearchMessage": "This metric compares the running projected cost of the current search to a hypothetical baseline search that could be conducted without using the intelligent coordinate selection logic built into this application.  The value reported is the difference in USD between the hypothetical naive search, and the search organized using greedy optimization. The naive baseline search is projected using a combination of the area of the search region, the size of the smallest search radius returned so far from a call to the Google API, and a heuristic multiple that is indicative of the percentage of search results that would be redundant if the search region were overlaid with a uniformly sized search radius such that all results within the search region would be found.  This hypothetical baseline accounts for the confines of the Google API, namely the 20-result limit per API call.",
  "about": "This tool is designed to help users quickly place Google Places API calls in a manner that minimizes total API costs when searching large geographic areas.  This tool does not store any Google Data, nor does it store user-generated data or API keys.  The search metadata, including all results received from the Google API, are available to download from the browser using the 'Download Data' button, however, it is the user’s responsibility that they use this collected data in accordance with the Google Terms of Service."
}
